README.md
```mermaid
sequenceDiagram

Client ->>+ Server : Request1 (needs Key1)
Server ->>+ CachedFinder : Key1
CachedFinder ->>+ CacheData : Find Key1
CacheData ->>+ CachedFinder : Key1 not found

Note right of CacheData: builds in progress: 0

CachedFinder ->>+ SlowOrigin : Key1

Note right of CacheData: first request starts the build<br/>builds in progress: 1

Client ->>+ Server : Request2 (needs Key1 too)
Server ->>+ CachedFinder : Key1
CachedFinder ->>+ CacheData : Find Key1
CacheData ->>+ CachedFinder : Key1 not found
CachedFinder ->>+ SlowOrigin : Key1

Note right of CacheData: first build is still in progress,<br/>cached value is missing,<br/>so second request starts the build<br/>builds in progress: 2

Client ->>+ Server : Request3 (needs Key1 too)
Server ->>+ CachedFinder : Key1
CachedFinder ->>+ CacheData : Find Key1
CacheData ->>+ CachedFinder : Key1 not found
CachedFinder ->>+ SlowOrigin : Key1

Note right of CacheData: first and second builds are still in progress,<br/>cached value is missing,<br/>so third request starts the build<br/>builds in progress: 3

SlowOrigin ->>+ CachedFinder : Value1 (initiated by Request1)

Note right of CacheData: first build is complete,<br/>cached value is stored,<br/>but other builds are still in progress<br/>builds in progress: 2

CachedFinder ->>+ CacheData : Store Key1 : Value1
CachedFinder ->>+ Server : Value1
Server ->>+ Client : Response1 (with Value1)

SlowOrigin ->>+ CachedFinder : Error (initiated by Request3)

Note right of CacheData: third build quickly failed,<br/>request is not served even though<br/>cache has a valid value at this point<br/>builds in progress: 1

CachedFinder ->>+ Server : Error
Server ->>+ Client : Response3 (with Error)

SlowOrigin ->>+ CachedFinder : Value1 (initiated by Request2)

Note right of CacheData: second build is complete,<br/>cached value overwrites same valid value,<br/>request is served with extra delay from the first build,<br/>builds in progress: 0

CachedFinder ->>+ CacheData : Store Key1 : Value1
CachedFinder ->>+ Server : Value1
Server ->>+ Client : Response2 (with Value1)

Client ->>+ Server : Request4 (needs Key1)
Server ->>+ CachedFinder : Key1
CachedFinder ->>+ CacheData : Find Key1

Note right of CacheData: cached value is immediately served to subsequent requests<br/>builds in progress: 0

CacheData ->>+ CachedFinder : Value1
CachedFinder ->>+ Server : Value1
Server ->>+ Client : Response4 (with Value1)

```
