README.md
```mermaid
sequenceDiagram

Client ->>+ Server : Request1 (needs Key1)
Server ->>+ CachedFinder : Key1
CachedFinder ->>+ FailoverCache : Get Key1 or build
FailoverCache ->>+ FailoverCache : Key1 not found
FailoverCache ->>+ FailoverCache : Acquire Key1 lock and build

Note right of FailoverCache: builds in progress: 0

FailoverCache ->>+ SlowOrigin : Key1

Note right of FailoverCache: first request starts the exclusive build<br/>builds in progress: 1

Client ->>+ Server : Request2 (needs Key1 too)
Server ->>+ CachedFinder : Key1
CachedFinder ->>+ FailoverCache : Get Key1 or build
FailoverCache ->>+ FailoverCache : Block on Key1 lock

Note right of FailoverCache: consecutive requests wait for the build to finish<br/>builds in progress: 1

Client ->>+ Server : Request3 (needs Key1 too)
Server ->>+ CachedFinder : Key1
CachedFinder ->>+ FailoverCache : Get Key1 or build
FailoverCache ->>+ FailoverCache : Block on Key1 lock

Note right of FailoverCache: builds in progress: 1


SlowOrigin ->>+ FailoverCache : Value1 (initiated by Request1)

Note right of FailoverCache: once build is complete, the value is stored<br/>and returned to all blocked requests<br/>builds in progress: 0

FailoverCache ->>+ FailoverCache : Store Key1 : Value1
FailoverCache ->>+ FailoverCache : Release Key1 lock

FailoverCache ->>+ CachedFinder : Value1
CachedFinder ->>+ Server : Value1
Server ->>+ Client : Response1 (with Value1)

FailoverCache ->>+ CachedFinder : Value1
CachedFinder ->>+ Server : Value1
Server ->>+ Client : Response2 (with Value1)

FailoverCache ->>+ CachedFinder : Value1
CachedFinder ->>+ Server : Value1
Server ->>+ Client : Response3 (with Value1)

Client ->>+ Server : Request4 (needs Key1 too)
Server ->>+ CachedFinder : Key1
CachedFinder ->>+ FailoverCache : Get Key1 or build
FailoverCache ->>+ CachedFinder : Value1

Note right of FailoverCache: cached value is immediately served to subsequent requests<br/>builds in progress: 0

CachedFinder ->>+ Server : Value1
Server ->>+ Client : Response4 (with Value1)
```
